heated_cubes/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    frontAndBack
    {
        type            patch;
        nFaces          600;
        startFace       144738;
    }
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       145338;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       145638;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       145938;
    }
    upperWall
    {
        type            patch;
        nFaces          100;
        startFace       146038;
    }
    cube1
    {
        type            wall;
        inGroups        List<word> 
2
(
cubeGroup
wall
)
;
        nFaces          4920;
        startFace       146138;
    }
    cube2
    {
        type            wall;
        inGroups        List<word> 
2
(
cubeGroup
wall
)
;
        nFaces          4064;
        startFace       151058;
    }
    cube3
    {
        type            wall;
        inGroups        List<word> 
2
(
cubeGroup
wall
)
;
        nFaces          5248;
        startFace       155122;
    }
)

// ************************************************************************* //
